/**
 * [요구사항]
 * H-Index는 과학자의 생산성과 영향력을 나타내는 지표.
 * 연구자가 발표한 논문 중 최소 H편이 각각 H번 이상 인용된 경우의 H 최대값.
 * 즉, 인용 횟수가 논문의 수와 같거나 큰 경우 그 숫자가 H-Index가 됨.
 * 주의할 점은 논문의 수와 그 논문들이 받은 인용 횟수가 모두 H 이상이어야 함
 *
 * [파라미터]
 * citations: 인용 횟수 0 이상 10,000이하
 * 과학자가 발표한 논문의 수(n)은 1 이상 1,000이하
 *
 * [예시]
 * citations : [3, 0, 6, 1, 5]
 * 발표한 논문의 수 : 5 (ciatations.length)
 * 0회 이상 인용된 논문 5편 : 인용 횟수가 h보다 적음
 * 1회 이상 인용된 논문 4편 : 인용 횟수가 h보다 적음
 * 3회 이상 인용된 논문 3편 : 3회 이상 인용된 논문이 3개로 같으므로 H-Index 3
 * 5회 이상 인용된 논문 2편 : 5회 이상 인용된 논문이 5개 미만
 * 6회 이상 인용된 논문 1편 : 6회 이상 인용된 논문이 6개 미만
 */

function solution(citations) {
  const answer = 0;
  return answer;
}
